happychriss/birdwatch-edge-platform/src/esp_bw_src/sdkconfig.defaults
# ─── Target ──────────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32s3"

# ─── Flash & PSRAM (XIAO ESP32-S3 Sense: 8 MB flash, 8 MB octal PSRAM) ──────
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# ─── Custom partition table ──────────────────────────────────────────────────
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ─── USB-CDC for serial logs over native USB (XIAO has no UART-USB chip) ────
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# ─── Verbose logging — deep debugging ────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y
CONFIG_LOG_COLORS=y

# ─── HTTP client — needs a generous buffer for multipart upload ─────────────
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=n

# ─── HTTP server (camera streaming mode) ────────────────────────────────────
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# ─── Increase main task stack (camera + HTTP + WiFi all need headroom) ─────
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ─── FreeRTOS tick rate (1 ms ticks help precise blink/delay) ───────────────
CONFIG_FREERTOS_HZ=1000

# ─── Brownout detector ──────────────────────────────────────────────────────
# Level 0 = ~2.43V threshold (least sensitive).
# Default level 7 (~2.80V) triggers on LiPo voltage sag during camera/WiFi
# current peaks and, with USE_INTR, causes a core dump instead of a clean
# reset.  Level 0 gives enough margin for a 3.7V LiPo through the XIAO LDO.
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_0=y
CONFIG_ESP_BROWNOUT_DET_LVL=0

# ─── Compiler ────────────────────────────────────────────────────────────────
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_WARN_WRITE_STRINGS=y
